In [2]:
import numpy as np
import pandas as pd
from pandas import Series
from pandas import DataFrame

# 数据处理与运算

## 重新索引reindex

### Series

In [5]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [6]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [7]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [3]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [4]:
# 向前插值,index要是升序的数值

obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### DataFrame

#### 重新索引行

In [5]:
frame = DataFrame(np.arange(9).reshape(3, 3), 
                  index = ['a', 'c', 'd'], 
                  columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [13]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

#### 重新索引列

In [6]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

#### 同时重新索引行和列

In [20]:
frame.reindex(index=['a', 'b', 'c', 'd'],  columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### loc的标签索引功能

In [10]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## 丢弃数据drop

### Series

In [13]:
obj = Series(np.arange(5), index=['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [14]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [15]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int64

### DataFrame

In [18]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
# 丢弃行

data.drop(['Ohio', 'Colorado'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
# 丢弃列

data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 索引、选取、过滤

### Series

In [23]:
obj = Series(np.arange(4), index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [30]:
# 通过标签索引

obj['b']

1

In [29]:
obj[['b','a', 'd']]

b    1
a    0
d    3
dtype: int64

In [38]:
# 标签切片与普通python切片运算不同

obj['b':'c']

b    1
c    2
dtype: int64

In [31]:
# 通过值索引

obj[1]

1

In [28]:
obj[2:4]

c    2
d    3
dtype: int64

In [34]:
obj[[1,3]]

b    1
d    3
dtype: int64

In [35]:
# 通过布尔值索引

obj[obj<2]

a    0
b    1
dtype: int64

In [40]:
# 通过索引更改dataframe中数值

obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int64

### DataFrame

In [51]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### 列索引
通过标签索引

In [43]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [44]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

#### 行索引
通过值索引

In [45]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [47]:
# 布尔型索引

data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### 布尔型DataFrame索引

In [48]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [50]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### loc
标签索引

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [57]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

#### iloc
序号值索引

In [53]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [54]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [55]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [56]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

## 算数运算

### Series

In [59]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [60]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [61]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

### DataFrame

In [62]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [63]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [64]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### 在算术方法中填充值

In [65]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [66]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [67]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [69]:
# 使用DataFrame的add方法，通过fill_value参数填充缺失值

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [70]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [71]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [74]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### DataFrame & Series

In [81]:
# 具有启发性的例子，这样的运算成为广播，DataFrame & Series的运算跟这个差不多

arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [79]:
arr[0]

array([0., 1., 2., 3.])

In [80]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [82]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [83]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [84]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [85]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [86]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [87]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [90]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 函数应用和映射
apply 用在dataframe上，用于对row或者column进行计算；

applymap 用于dataframe上，是元素级别的操作；

map （其实是python自带的）用于series上，是元素级别的操作。

In [3]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.034342 -1.274233  0.558268
Ohio    2.073693  0.210126 -0.472440
Texas   0.922653 -0.275248 -0.363936
Oregon -0.625123  2.206471 -1.289869

In [16]:
# numpy元素级数组方法

np.abs(frame)

               b         d         e
Utah    0.034342  1.274233  0.558268
Ohio    2.073693  0.210126  0.472440
Texas   0.922653  0.275248  0.363936
Oregon  0.625123  2.206471  1.289869

### 例1

In [22]:
# apply 用在dataframe上，用于对row或者column进行计算

f = lambda x: x.max() - x.min()

frame.apply(f)

b    2.698816
d    3.480704
e    1.848137
dtype: float64

In [8]:
frame.apply(f, axis='columns')

Utah      1.832501
Ohio      2.546133
Texas     1.286589
Oregon    3.496340
dtype: float64

### 例2

In [15]:
#两个等价

def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

f = lambda x: Series([x.max(), x.min()], index=['max', 'min'])
frame.apply(f)

            b         d         e
max  2.073693  2.206471  0.558268
min -0.625123 -1.274233 -1.289869

### 例3

In [19]:
# applymap 用于dataframe上，是元素级别的操作

format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.03  -1.27   0.56
Ohio     2.07   0.21  -0.47
Texas    0.92  -0.28  -0.36
Oregon  -0.63   2.21  -1.29

In [21]:
# map （其实是python自带的）用于series上，是元素级别的操作

frame['e'].map(format)

Utah       0.56
Ohio      -0.47
Texas     -0.36
Oregon    -1.29
Name: e, dtype: object

## 排序和排名

### 对行或列的索引进行排序
sort_index

#### Series

In [23]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [25]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

#### DataFrame

In [27]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [28]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [29]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [31]:
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 对行或列的值进行排序
sort_values

#### Series

In [33]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [35]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

#### DataFrame

In [36]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [37]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [38]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### 排名
rank()  
出现两个相同值时，默认method = ‘average’，按照*.5记；  
method = ‘first’，两个相同的值按照出现的先后顺序分配排名；  
method = ‘max’，两个相同的值按照出现的最大排名。

#### Series

In [39]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [40]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [41]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

#### DataFrame

In [43]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [44]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## 带有重复值的轴索引
is_unique属性可以判断索引是否唯一

In [4]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [6]:
obj.index.is_unique

False

In [7]:
obj['a']

a    0
a    1
dtype: int64

In [8]:
obj['c']

4

In [16]:
frame=DataFrame(np.random.randn(4,3), index=['a', 'c', 'b', 'b'])
frame

          0         1         2
a -0.605714  0.386967 -0.542571
c -0.306152 -0.721650  0.726096
b -0.262043  0.519468  0.629681
b -0.878824 -0.735491 -0.497660

In [17]:
frame.index.is_unique

False

In [19]:
frame.loc['b']

          0         1         2
b -0.262043  0.519468  0.629681
b -0.878824 -0.735491 -0.497660

# 汇总和计算描述统计

In [20]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

### sum

In [23]:
# NA值会被自动排除

df.sum()

one    9.25
two   -5.80
dtype: float64

In [22]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

### mean

In [25]:
# 禁止自动排除NA值

df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

### idxmax

In [28]:
# 最大值的索引

df.idxmax()

one    b
two    d
dtype: object

### cumsum

In [32]:
# 累加运算

df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

### describe

In [34]:
# 汇总统计

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [35]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [36]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 相关系数与协方差

conda install pandas-datareader  
corr相关系数  
cov协方差

In [50]:
import pandas_datareader.data as web

In [49]:
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    dict = {ticker: web.get_data_yahoo(ticker)}
    print(dict)

{'AAPL':                   High         Low        Open       Close      Volume  \
Date
2014-09-29  100.440002   98.629997   98.650002  100.110001  49766300.0
2014-09-30  101.540001  100.529999  100.809998  100.750000  55264100.0
2014-10-01  100.690002   98.699997  100.589996   99.180000  51491300.0
2014-10-02  100.220001   98.040001   99.269997   99.900002  47757800.0
2014-10-03  100.209999   99.040001   99.440002   99.620003  43469600.0
...                ...         ...         ...         ...         ...
2019-09-23  219.839996  217.649994  218.949997  218.720001  19165500.0
2019-09-24  222.490005  217.190002  221.029999  217.679993  31190800.0
2019-09-25  221.500000  217.139999  218.550003  221.029999  21903400.0
2019-09-26  220.940002  218.830002  220.000000  219.889999  18833500.0
2019-09-27  220.960007  217.279999  220.539993  218.820007  25352000.0

             Adj Close
Date
2014-09-29   91.860641
2014-09-30   92.447876
2014-10-01   91.007271
2014-10-02   91.667946
2014-10-03   91.411026
...                ...
2019-09-23  218.720001
2019-09-24  217.679993
2019-09-25  221.029999
2019-09-26  219.889999
2019-09-27  218.820007

[1259 rows x 6 columns]}
{'IBM':                   High         Low        Open       Close     Volume  \
Date
2014-09-29  189.960007  188.119995  188.509995  189.639999  2336300.0
2014-09-30  190.850006  189.149994  189.639999  189.830002  2932600.0
2014-10-01  190.399994  186.789993  189.910004  187.169998  3723200.0
2014-10-02  187.779999  186.240005  187.660004  186.910004  2283100.0
2014-10-03  189.369995  187.559998  188.110001  188.669998  3071500.0
...                ...         ...         ...         ...        ...
2019-09-23  142.220001  140.559998  141.190002  142.070007  1817900.0
2019-09-24  142.889999  141.070007  142.500000  141.679993  3231600.0
2019-09-25  143.630005  140.860001  141.740005  143.160004  2526700.0
2019-09-26  143.880005  141.410004  143.169998  143.550003  2309800.0
2019-09-27  145.089996  142.380005  144.410004  143.240005  2356800.0

             Adj Close
Date
2014-09-29  153.569412
2014-09-30  153.723282
2014-10-01  151.569229
2014-10-02  151.358704
2014-10-03  152.783905
...                ...
2019-09-23  142.070007
2019-09-24  141.679993
2019-09-25  143.160004
2019-09-26  143.550003
2019-09-27  143.240005

[1259 rows x 6 columns]}
{'MSFT':                   High         Low        Open       Close      Volume  \
Date
2014-09-29   46.560001   45.759998   45.980000   46.439999  26091000.0
2014-09-30   46.480000   46.009998   46.369999   46.360001  33033100.0
2014-10-01   46.529999   45.849998   46.270000   45.900002  38088400.0
2014-10-02   46.099998   45.639999   45.830002   45.759998  25119400.0
2014-10-03   46.299999   45.610001   45.980000   46.090000  32453200.0
...                ...         ...         ...         ...         ...
2019-09-23  139.630005  138.440002  139.229996  139.139999  17139300.0
2019-09-24  140.690002  136.880005  140.360001  137.380005  29773200.0
2019-09-25  139.960007  136.029999  137.500000  139.360001  21382000.0
2019-09-26  140.179993  138.440002  139.440002  139.539993  17456600.0
2019-09-27  140.360001  136.649994  140.149994  137.729996  22477700.0

             Adj Close
Date
2014-09-29   41.571568
2014-09-30   41.499958
2014-10-01   41.088188
2014-10-02   40.962856
2014-10-03   41.258266
...                ...
2019-09-23  139.139999
2019-09-24  137.380005
2019-09-25  139.360001
2019-09-26  139.539993
2019-09-27  137.729996

[1259 rows x 6 columns]}
{'GOOG':                    High          Low         Open        Close     Volume  \
Date
2014-09-29   576.606934   569.606140   570.184570   574.781921  1282400.0
2014-09-30   578.262390   571.281555   575.350403   575.779175  1621700.0
2014-10-01   575.998596   565.457520   574.432922   566.714111  1445400.0
2014-10-02   570.344116   561.777649   565.756714   568.519104  1178400.0
2014-10-03   575.644592   570.932495   571.481018   573.704895  1141700.0
...                 ...          ...          ...          ...        ...
2019-09-23  1239.089966  1224.170044  1226.000000  1234.030029  1062400.0
2019-09-24  1246.739990  1210.680054  1240.000000  1218.760010  1583200.0
2019-09-25  1248.300049  1210.089966  1215.819946  1246.520020  1453000.0
2019-09-26  1245.000000  1232.267944  1241.959961  1241.390015  1538000.0
2019-09-27  1244.020020  1214.449951  1243.010010  1225.089966  1353900.0

              Adj Close
Date
2014-09-29   574.781921
2014-09-30   575.779175
2014-10-01   566.714111
2014-10-02   568.519104
2014-10-03   573.704895
...                 ...
2019-09-23  1234.030029
2019-09-24  1218.760010
2019-09-25  1246.520020
2019-09-26  1241.390015
2019-09-27  1225.089966

[1259 rows x 6 columns]}

In [41]:
# 跟上面那个等价
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
print(all_data)

{'AAPL':                   High         Low        Open       Close      Volume  \
Date
2014-09-29  100.440002   98.629997   98.650002  100.110001  49766300.0
2014-09-30  101.540001  100.529999  100.809998  100.750000  55264100.0
2014-10-01  100.690002   98.699997  100.589996   99.180000  51491300.0
2014-10-02  100.220001   98.040001   99.269997   99.900002  47757800.0
2014-10-03  100.209999   99.040001   99.440002   99.620003  43469600.0
...                ...         ...         ...         ...         ...
2019-09-23  219.839996  217.649994  218.949997  218.720001  19165500.0
2019-09-24  222.490005  217.190002  221.029999  217.679993  31190800.0
2019-09-25  221.500000  217.139999  218.550003  221.029999  21903400.0
2019-09-26  220.940002  218.830002  220.000000  219.889999  18833500.0
2019-09-27  220.960007  217.279999  220.539993  218.820007  25352000.0

             Adj Close
Date
2014-09-29   91.860641
2014-09-30   92.447876
2014-10-01   91.007271
2014-10-02   91.667946
2014-10-03   91.411026
...                ...
2019-09-23  218.720001
2019-09-24  217.679993
2019-09-25  221.029999
2019-09-26  219.889999
2019-09-27  218.820007

[1259 rows x 6 columns], 'IBM':                   High         Low        Open       Close     Volume  \
Date
2014-09-29  189.960007  188.119995  188.509995  189.639999  2336300.0
2014-09-30  190.850006  189.149994  189.639999  189.830002  2932600.0
2014-10-01  190.399994  186.789993  189.910004  187.169998  3723200.0
2014-10-02  187.779999  186.240005  187.660004  186.910004  2283100.0
2014-10-03  189.369995  187.559998  188.110001  188.669998  3071500.0
...                ...         ...         ...         ...        ...
2019-09-23  142.220001  140.559998  141.190002  142.070007  1817900.0
2019-09-24  142.889999  141.070007  142.500000  141.679993  3231600.0
2019-09-25  143.630005  140.860001  141.740005  143.160004  2526700.0
2019-09-26  143.880005  141.410004  143.169998  143.550003  2309800.0
2019-09-27  145.089996  142.380005  144.410004  143.240005  2356800.0

             Adj Close
Date
2014-09-29  153.569412
2014-09-30  153.723282
2014-10-01  151.569229
2014-10-02  151.358704
2014-10-03  152.783905
...                ...
2019-09-23  142.070007
2019-09-24  141.679993
2019-09-25  143.160004
2019-09-26  143.550003
2019-09-27  143.240005

[1259 rows x 6 columns], 'MSFT':                   High         Low        Open       Close      Volume  \
Date
2014-09-29   46.560001   45.759998   45.980000   46.439999  26091000.0
2014-09-30   46.480000   46.009998   46.369999   46.360001  33033100.0
2014-10-01   46.529999   45.849998   46.270000   45.900002  38088400.0
2014-10-02   46.099998   45.639999   45.830002   45.759998  25119400.0
2014-10-03   46.299999   45.610001   45.980000   46.090000  32453200.0
...                ...         ...         ...         ...         ...
2019-09-23  139.630005  138.440002  139.229996  139.139999  17139300.0
2019-09-24  140.690002  136.880005  140.360001  137.380005  29773200.0
2019-09-25  139.960007  136.029999  137.500000  139.360001  21382000.0
2019-09-26  140.179993  138.440002  139.440002  139.539993  17456600.0
2019-09-27  140.360001  136.649994  140.149994  137.729996  22477700.0

             Adj Close
Date
2014-09-29   41.571568
2014-09-30   41.499958
2014-10-01   41.088188
2014-10-02   40.962856
2014-10-03   41.258266
...                ...
2019-09-23  139.139999
2019-09-24  137.380005
2019-09-25  139.360001
2019-09-26  139.539993
2019-09-27  137.729996

[1259 rows x 6 columns], 'GOOG':                    High          Low         Open        Close     Volume  \
Date
2014-09-29   576.606934   569.606140   570.184570   574.781921  1282400.0
2014-09-30   578.262390   571.281555   575.350403   575.779175  1621700.0
2014-10-01   575.998596   565.457520   574.432922   566.714111  1445400.0
2014-10-02   570.344116   561.777649   565.756714   568.519104  1178400.0
2014-10-03   575.644592   570.932495   571.481018   573.704895  1141700.0
...                 ...          ...          ...          ...        ...
2019-09-23  1239.089966  1224.170044  1226.000000  1234.030029  1062400.0
2019-09-24  1246.739990  1210.680054  1240.000000  1218.760010  1583200.0
2019-09-25  1248.300049  1210.089966  1215.819946  1246.520020  1453000.0
2019-09-26  1245.000000  1232.267944  1241.959961  1241.390015  1538000.0
2019-09-27  1244.020020  1214.449951  1243.010010  1225.089966  1353900.0

              Adj Close
Date
2014-09-29   574.781921
2014-09-30   575.779175
2014-10-01   566.714111
2014-10-02   568.519104
2014-10-03   573.704895
...                 ...
2019-09-23  1234.030029
2019-09-24  1218.760010
2019-09-25  1246.520020
2019-09-26  1241.390015
2019-09-27  1225.089966

[1259 rows x 6 columns]}

In [ ]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [42]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2014-09-29   91.860641  153.569412   41.571568   574.781921
2014-09-30   92.447876  153.723282   41.499958   575.779175
2014-10-01   91.007271  151.569229   41.088188   566.714111
2014-10-02   91.667946  151.358704   40.962856   568.519104
2014-10-03   91.411026  152.783905   41.258266   573.704895
...                ...         ...         ...          ...
2019-09-23  218.720001  142.070007  139.139999  1234.030029
2019-09-24  217.679993  141.679993  137.380005  1218.760010
2019-09-25  221.029999  143.160004  139.360001  1246.520020
2019-09-26  219.889999  143.550003  139.539993  1241.390015
2019-09-27  218.820007  143.240005  137.729996  1225.089966

[1259 rows x 4 columns]

In [43]:
volume

                  AAPL        IBM        MSFT       GOOG
Date
2014-09-29  49766300.0  2336300.0  26091000.0  1282400.0
2014-09-30  55264100.0  2932600.0  33033100.0  1621700.0
2014-10-01  51491300.0  3723200.0  38088400.0  1445400.0
2014-10-02  47757800.0  2283100.0  25119400.0  1178400.0
2014-10-03  43469600.0  3071500.0  32453200.0  1141700.0
...                ...        ...         ...        ...
2019-09-23  19165500.0  1817900.0  17139300.0  1062400.0
2019-09-24  31190800.0  3231600.0  29773200.0  1583200.0
2019-09-25  21903400.0  2526700.0  21382000.0  1453000.0
2019-09-26  18833500.0  2309800.0  17456600.0  1538000.0
2019-09-27  25352000.0  2356800.0  22477700.0  1353900.0

[1259 rows x 4 columns]

In [52]:
returns = price.pct_change()
returns

                AAPL       IBM      MSFT      GOOG
Date
2014-09-29       NaN       NaN       NaN       NaN
2014-09-30  0.006393  0.001002 -0.001723  0.001735
2014-10-01 -0.015583 -0.014013 -0.009922 -0.015744
2014-10-02  0.007260 -0.001389 -0.003050  0.003185
2014-10-03 -0.002803  0.009416  0.007212  0.009122
...              ...       ...       ...       ...
2019-09-23  0.004547  0.001339 -0.002151  0.003334
2019-09-24 -0.004755 -0.002745 -0.012649 -0.012374
2019-09-25  0.015390  0.010446  0.014413  0.022777
2019-09-26 -0.005158  0.002724  0.001292 -0.004115
2019-09-27 -0.004866 -0.002160 -0.012971 -0.013130

[1259 rows x 4 columns]

In [53]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-09-23  0.004547  0.001339 -0.002151  0.003334
2019-09-24 -0.004755 -0.002745 -0.012649 -0.012374
2019-09-25  0.015390  0.010446  0.014413  0.022777
2019-09-26 -0.005158  0.002724  0.001292 -0.004115
2019-09-27 -0.004866 -0.002160 -0.012971 -0.013130

### Series&Series相关系数corr、协方差cov

In [56]:
# 相关系数
returns['MSFT'].corr(returns['IBM'])

0.4775611301617116

In [57]:
# 协方差
returns['MSFT'].cov(returns['IBM'])

9.31541230833454e-05

In [58]:
returns.MSFT.corr(returns.IBM)

0.4775611301617116

### DataFrame相关系数corr、协方差cov

In [59]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.393446  0.573123  0.520007
IBM   0.393446  1.000000  0.477561  0.404453
MSFT  0.573123  0.477561  1.000000  0.652889
GOOG  0.520007  0.404453  0.652889  1.000000

In [60]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000246  0.000081  0.000134  0.000124
IBM   0.000081  0.000172  0.000093  0.000081
MSFT  0.000134  0.000093  0.000221  0.000148
GOOG  0.000124  0.000081  0.000148  0.000233

### DataFrame&Series相关系数corrwith

In [61]:
returns.corrwith(returns.IBM)

AAPL    0.393446
IBM     1.000000
MSFT    0.477561
GOOG    0.404453
dtype: float64

In [62]:
returns.corrwith(volume)

AAPL   -0.108697
IBM    -0.156933
MSFT   -0.085673
GOOG   -0.018069
dtype: float64

## 唯一值、值计数以及成员资格

### unique

In [63]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [77]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

### value_counts

In [69]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [73]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
a    3
c    3
dtype: int64

In [83]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [86]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### isin

In [81]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [82]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### get_indexer

In [89]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [90]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [91]:
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [93]:
# get_indexer获取to_match中值在unique_vals中的索引

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])